#include "bsp_key.h"
#include "bsp.h"
/*
    4、输入检测
        12V电源输入监测:       PD0
*/

/*
*********************************************************************************************************
*    函 数 名: bsp_InitKey
*    功能说明: 初始化按键.
*    形    参: 无
*    返 回 值: 无
*********************************************************************************************************
*/
void bsp_InitKey(void)
{
    rcu_periph_clock_enable(PWR_GPIO_CLK);

    /* configure button pin as input */
    gpio_mode_set(PWR_GPIO_PORT, GPIO_MODE_INPUT, GPIO_PUPD_NONE,PWR_GPIO_PIN);
    
}

/*
*********************************************************************************************************
*    函 数 名: key_test
*    功能说明: 按键测试.
*    形    参: 无
*    返 回 值: 无
*********************************************************************************************************
*/
void key_test(void)
{
    while(1)
    {
        printf("PWR   = %d...",PWR_TST_READ);
        delay_ms(1000);        
    }
}
/******************************************  (END OF FILE) **********************************************/

