/*
*********************************************************************************************************
*
*	模块名称 : 按键驱动模块
*	文件名称 : etbn_app.h
*	版    本 : V1.0
*	说    明 : 头文件
*
*	Copyright (C), 2013-2014, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/

#ifndef __ETBN_APP_H
#define __ETBN_APP_H

#include "sys.h"


/* 内部调用的函数声明 */
void Key_GPIOInit(void);

/* 供外部调用的函数声明 */
void ebtn_app_init(void);
void etbn_Scan1ms(uint32_t tick);  // 基本定时器调用


/* 测试例程 */
void ETBN_Test(void);

#endif

/***************************** 安富莱电子 www.armfly.com (END OF FILE) *********************************/
