/*
*********************************************************************************************************
*    函 数 名: 串行Flash读写演示模块。
*    功能说明: sfDemo.h
*    形    参: V1.0
*    返 回 值: 头文件
*    修改记录 :
*        版本号  日期       作者    说明
*        v1.0    2011-05-13 armfly  ST固件库V3.5.0版本。
*    Copyright (C), 2010-2011, 安富莱电子 www.armfly.com
*********************************************************************************************************
*/

#ifndef _SFDEMO_H
#define _SFDEMO_H

/* 供外部调用的函数声明 */
void DemoSpiFlash(void);

#endif


