/*
*********************************************************************************************************
*
*	模块名称 : 头文件汇总
*	文件名称 : appconfig.h
*	版    本 : V1.0
*	说    明 : 当前使用头文件汇总
*
*	修改记录 :
*		版本号    日期        作者     说明
*		V1.0    2025-10-14  fengniao   首次发布
*
*	Copyright (C), 2015-2020,
*
*********************************************************************************************************
*/
#ifndef _APPCONFIG_H_
#define _APPCONFIG_H_

/*
*********************************************************************************************************
*                                        版本号
*********************************************************************************************************
*/
#define SOFT_NO_STR "1.0.3.20260501" // 软件版本号
#define HARD_NO_STR	"FN-ZJTY-PY"     // 硬件版本号

/*
*********************************************************************************************************
*                                      设备版本号
*********************************************************************************************************
*/
#define COM_DATA_VERSION  0x11

/*
*********************************************************************************************************
*                                         标准库
*********************************************************************************************************
*/
#include  <stdarg.h>
#include  <stdio.h>
#include  <stdlib.h>
#include  <math.h>
#include  <time.h>
#include  <stddef.h>
#include  <string.h>
/*
*********************************************************************************************************
*                                         应用库
*********************************************************************************************************
*/
//#include "SEGGER_RTT.h"
#include "cJSON.h"
#include "mycJSON.h"
#include "tool.h"
#include "crc.h"
#include "md5.h"
#include "SHA1.h"
//#include "cmox_crypto.h"
//#include <cm_backtrace.h>

#include "ebtn_APP.h"
#include "ebtn_APP_Keys.h"
/*
*********************************************************************************************************
*                                         驱动库
*********************************************************************************************************
*/
//#include "hal_lis3dh.h"
//#include "lis3dh_driver.h" 
//#include "lis3dh_iic.h"
//#include "lis3dh_spi.h"

//#include "BL0939.h"

//#include "LAN8720.h"
//#include "GPRS.h"
//#include "GPS.h" 
//#include "w25qxx.h"
//#include "aht20.h"

//#include "ATGM336H.h"

/*
*********************************************************************************************************
*                                     FreeRTOS 库
*********************************************************************************************************
*/
#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"

/*
*********************************************************************************************************
*                                        内存管理
*********************************************************************************************************
*/
#include "./MALLOC/malloc.h"

/*
*********************************************************************************************************
*                                         LWIP网络
*********************************************************************************************************
*/
 #include "lwip_comm.h"
 #include "lwip_ping.h"
 #include "tcp_client.h"
 #include "httpd.h"
 #include "httpd_cgi_ssi.h"

 #include "onvif.h"
 #include "onvif_tcp.h"

 #include "port_scan.h"
 #include "rtsp_task.h"

 #include "snmp_udp.h"

#include "ethernetif.h"
#include "lwipopts.h"

#include <lwip/sockets.h>
#include "lwip/opt.h"
#include "lwip/sys.h"
#include "lwip/api.h"
#include "netif/etharp.h"
#include "lwip/dhcp.h"
#include "lwip/mem.h"
#include "lwip/memp.h"
#include "lwip/init.h"
#include "lwip/timeouts.h"
#include "lwip/tcpip.h"
#include "lwip/icmp.h"
#include "lwip/igmp.h"
#include "lwip/raw.h"
#include "lwip/dns.h"
/*
*********************************************************************************************************
*                                         OTA升级
*********************************************************************************************************
*/
 #include "update.h"
 #include "update_http.h"

/*
*********************************************************************************************************
*                                        APP / BSP
*********************************************************************************************************
*/
#include  <bsp.h>

 #include "error.h"

#include "./USER/inc/start.h"
 #include "app.h"
 #include "det.h"
 #include "eth.h"
 #include "gsm.h"
 #include "com.h"
 #include "save.h"
 #include "print.h"
 #include <queue.h>
 #include "udp_multicast.h"
// #include "de_encode.h"
// #include "myencrypt.h"
// #include "mydecrypt.h"
/*
*********************************************************************************************************
*                                          文件系统
*********************************************************************************************************
*/
 #include "lfs_port.h"
 #include "lfs.h"


/*
*********************************************************************************************************
*                                       功能选择
*********************************************************************************************************
*/
//#define COM_GPS_ENABLE   // GPS功能
//#define SPD_ENABLE 		     // 防雷器
#define WATER_ENABLE 		   // 水浸检测
#define ANGLE_ENABLE 		   // 倾斜度检测
#define MCB_ENABLE 		     // 倾斜度检测
/*
*********************************************************************************************************
*                                       DEBUG调试
*********************************************************************************************************
*/
#define PING_DEBUG   				0
#define COM_DEBUG    				0  
#define ERROR_DEBUG  				0
#define ENCRYPT_DEBUG     	0

/*
*********************************************************************************************************
*                                           宏定义
*********************************************************************************************************
*/
#define PRIORITY_CONNECTION_MODE 1 // 0-有线优先连接 1-无线优先连接

#if (PRIORITY_CONNECTION_MODE == 1) 
#define WIRELESS_PRIORITY_CONNECTION // 无线优先连接
#else
#define WIRED_PRIORITY_CONNECTION    // 有线优先连接
#endif

/*
*********************************************************************************************************
*                                          FLASH存储位置
*********************************************************************************************************
*/
#define DEVICE_FLASH_STORE	    0x08004000
#define DEVICE_ID_ADDR          DEVICE_FLASH_STORE
#define DEVICE_MAC_ADDR         DEVICE_FLASH_STORE + 64
#define DEVICE_ELECTRICITY_ADDR 0x08008000
#endif

/*****************************************  (END OF FILE) *********************************************/

